"""
@ 全局变量配置
@ 重要参数配置
"""

DEBUG = False  # 全局调试变量

# initial set up
OFDMCarrierCount = 1000  # OFDM信号所携带的载波数目设置
SymbolPerCarrier = 10  # 每一个载波设置的符号数目，ofdm符号数目
BitsPerSymbol = 4  # 每一个符号所带的信息量，4比特，默认用16QAM
IFFTLength = 2048  # IFFT长度
PrefixRatio = 1 / 4  #保护间隔与OFDM数据的比例 1/6~1/4
GI = int(PrefixRatio * IFFTLength)  # 每一个OFDM符号添加的循环前缀长度为1/4*IFFT_bin_length  即保护间隔长度为128
beta = 1 / 32  # 窗函数滚降系数
GIP = int(beta * (IFFTLength + GI))  # 循环后缀的长度20
TxLength = SymbolPerCarrier * (IFFTLength + GI + GIP)
# calc type
CalcBitsError = True  # 是否计算误比特率

# debug
PrimaryProcessDebug = False  # 是否做主过程调试

# sim set up
SNRStart = -100
SNREnd = 150
SNRPath = 0.1
SNRDis = SNREnd - SNRStart

# 16QAM映射图
mapping = {'0': (3, 3), '1': (1, 3), '2': (-3, 3), '3': (-1, 3),
           '4': (3, 1), '5': (1, 1), '6': (-3, 1), '7': (-1, 1),
           '8': (3, -3), '9': (1, -3), '10': (-3, -3), '11': (-1, -3),
           '12': (3, -1), '13': (1, -1), '14': (-3, -1), '15': (-1, -1)}

# # 16QAM映射图
# mapping = {'11': (-3, 3), '9': (-1, 3), '14': (1, 3), '15': (3, 3),
#            '10': (-3, 1), '8': (-1, 1), '12': (1, 1), '13': (3, 1),
#            '1': (-3, -1), '0': (-1, -1), '4': (1, -1), '6': (3, -1),
#            '3': (-3, -3), '2': (-1, -3), '5': (1, -3), '7': (3, -3)}

# # 16QAM映射图
# mapping = {'14': (-3, 3), '10': (-1, 3), '2': (1, 3), '6': (3, 3),
#            '15': (-3, 1), '11': (-1, 1), '3': (1, 1), '7': (3, 1),
#            '13': (-3, -1), '9': (-1, -1), '1': (1, -1), '5': (3, -1),
#            '12': (-3, -3), '8': (-1, -3), '0': (1, -3), '4': (3, -3)}

# # 16QAM映射图
# mapping = {'0': (-3, 3), '4': (-1, 3), '12': (1, 3), '8': (3, 3),
#            '1': (-3, 1), '5': (-1, 1), '13': (1, 1), '9': (3, 1),
#            '3': (-3, -1), '7': (-1, -1), '15': (1, -1), '11': (3, -1),
#            '2': (-3, -3), '6': (-1, -3), '14': (1, -3), '10': (3, -3)}
# 0000         0100           1100         1000
# 0001         0101           1101         1001
# 0011         0111           1111         1011
# 0010         0110           1110         1010
